[
    {
        "title": "Longthroat memoirs",
        "description": "Longthroat Memoirs presents a sumptuous menu of essays about Nigerian food, lovingly presented by the nation's top epicurean writer. As well as a mouth-watering appraisal of the cultural politics and erotics of Nigerian cuisine, it is also a series of love letters to the Nigerian palate. From innovations in soup, fish as aphrodisiac and the powerful seductions of the yam, Longthroat Memoirs examines the complexities, the peculiarities, the meticulousness, and the tactility of Nigerian food. Nigeria has a strong culture of oral storytelling, of myth creation, of imaginative traversing of worlds. Longthroat Memoirs collates some of those stories into an irresistible soup-pot, expressed in the flawless love language of appetite and nourishment. A sensuous testament on why, when and how Nigerians eat the food they love to eat; this book is a welcome addition to the global dining table of ideas.",
        "authors": [
            {
                "key": "/authors/OL9319987A",
                "name": "Yemisí Aríbisálà"
            }
        ],
        "isbn": "9781911115267",
        "image-url": "https://prestigebookshop.com/wp-content/uploads/2019/02/book-image-18748.jpg",
        "price": "1850",
        "publisher": [
            "Cassava Republic Press"
        ],
        "edition": "Second edition.",
        "num_pages": "339",
        "publish_date": "2016",
        "subjects": [
            "Food",
            "Nutrition"
        ],
        "latest_revision": 6,
        "publish_places": [],
        "copyright_date": null
    },
    {
        "title": "Inheritors of the Earth",
        "description": "It is accepted wisdom today that human beings have irrevocably damaged the natural world. Yet what if this narrative obscures a more hopeful truth? In \"Inheritors of the Earth\", renowned ecologist and environmentalist Chris D. Thomas overturns the accepted story, revealing how nature is fighting back. Many animals and plants actually benefit from our presence, raising biological diversity in most parts of the world and increasing the rate at which new species are formed, perhaps to the highest level in Earth's history. From Costa Rican tropical forests to the thoroughly transformed British landscape, nature is coping surprisingly well in the human epoch. Chris Thomas takes us on a gripping round-the-world journey to meet the enterprising creatures that are thriving in the Anthropocene, from York's ochre-coloured comma butterfly to hybrid bison in North America, scarlet-beaked pukekos in New Zealand, and Asian palms forming thickets in the European Alps. In so doing, he questions our irrational persecution of so-called 'invasive species', and shows us that we should not treat the Earth as a faded masterpiece that we need to restore. After all, if life can recover from the asteroid that killed off the dinosaurs, might it not be able to survive the onslaughts of a technological ape?",
        "authors": [
            {
                "key": "/authors/OL2691594A",
                "name": "C. D. Thomas"
            }
        ],
        "isbn": "9781610397278",
        "image-url": "https://prestigebookshop.com/wp-content/uploads/2019/02/book-image-17972.jpg",
        "price": "2890",
        "publisher": [
            "Public Affairs"
        ],
        "edition": "First US edition.",
        "num_pages": "300",
        "publish_date": "2017",
        "subjects": [
            "SCIENCE"
        ],
        "latest_revision": 9,
        "publish_places": [],
        "copyright_date": "2017"
    },
    {
        "title": "The 80/20 principle",
        "description": "\"The 80/20 Principle shows how you can achieve much more with much less effort, time, and resources, simply by concentrating on the all-important 20 percent.\".\n\n\"The pattern of predictable imbalance underlying the 80/20 Principle was first discovered a hundred years ago by Italian economist Vilfredo Pareto while studying income and wealth patterns. But the pattern of \"predictable imbalance,\" as he termed it, crops up throughout life. In The 80/20 Principle, Koch opens our eyes to the way the principle works through a wide range of examples in business, commerce, and virtually every aspect of our lives.\n\nFor example, 20 percent of products account for 80 percent of sales and profits; similarly, 20 percent of customers account for 80 percent of revenues.\".\n\n\"By identifying and focusing on the 20 percent of our efforts that result in the huge bulk of our success, we can leverage our efforts to vastly increase our effectiveness. For we discover that little of what we do really counts. By concentrating on those things that do, we can transform our effectiveness in our jobs, our careers, our businesses, and our lives.\"--BOOK JACKET.",
        "authors": [
            {
                "key": "/authors/OL398478A",
                "name": "Koch, Richard"
            }
        ],
        "isbn": "9780385491747",
        "image-url": "https://prestigebookshop.com/wp-content/uploads/2019/02/book-image-3843.jpg",
        "price": "2050",
        "publisher": [
            "Doubleday"
        ],
        "edition": "Rev. and updated ed.",
        "num_pages": "269",
        "publish_date": "2008",
        "subjects": [
            "Time management.",
            "Business"
        ],
        "latest_revision": 9,
        "publish_places": [
            "New York"
        ],
        "copyright_date": null
    },
    {
        "title": "Binti",
        "description": "It's been a year since Binti and Okwu enrolled at Oomza University. A year since Binti was declared a hero for uniting two warring planets. A year since she found friendship in the unlikeliest of places. And now she must return home to her people, with her friend Okwu by her side, to face her family and face her elders. But Okwu will be the first of his race to set foot on Earth in over a hundred years, and the first ever to come in peace. After generations of conflict can human and Meduse ever learn to truly live in harmony?",
        "authors": [
            {
                "key": "/authors/OL7350596A",
                "name": "Nnedi Okorafor"
            }
        ],
        "isbn": "9780765393111",
        "image-url": "https://prestigebookshop.com/wp-content/uploads/2019/02/book-image-18445.jpg",
        "price": "1550",
        "publisher": [
            "Tordotcom",
            "St. Martins Press-3PL"
        ],
        "edition": "First edition.",
        "num_pages": "164",
        "publish_date": "2017",
        "subjects": [
            "Fiction"
        ],
        "latest_revision": 8,
        "publish_places": [],
        "copyright_date": null
    },
    {
        "title": "The Handmaid's Tale",
        "description": "The Republic of Gilead offers Offred only one function: to breed. If she deviates, she will, like dissenters, be hanged at the wall or sent out to die slowly of radiation sickness. But even a repressive state cannot obliterate desire – neither Offred's nor that of the two men on which her future hangs.",
        "authors": [
            {"name": "Margaret Atwood"}
        ],
        "isbn": "9781784873189",
        "image-url": "https://kibangabooks.com/wp-content/uploads/2023/11/The-HANDMAIDS-TALE-book-by-Author-Margaret-Atwood1680418916.jpeg",
        "price": "1250",
        "publisher": [
            "Vintage"
        ],
        "edition": "printing (13)",
        "num_pages": "341",
        "publish_date": "2017",
        "subjects": [
            "Fiction"
        ],
        "latest_revision": 5,
        "publish_places": [
            "London"
        ],
        "copyright_date": "2017"
    },
    {
        "title": "Keeping hope alive",
        "description": "\"The ... memoir of one brave woman who, along with her daughters, has kept tens of thousands of her fellow Somali citizens safe, healthy, and educated for more than twenty years\"--Dust jacket flap.",
        "authors": [
            {
                "key": "/authors/OL7422570A",
                "name": "Hawa Abdi"
            }
        ],
        "isbn": "9781844087884",
        "image-url": "https://prestigebookshop.com/wp-content/uploads/2019/02/book-image-14773.jpg",
        "price": "2290",
        "publisher": [
            "Grand Central Pub.",
            "Grand Central Publishing",
            "Little, Brown Book Group"
        ],
        "edition": "1st ed.",
        "num_pages": "246",
        "publish_date": "2013",
        "subjects": [
  
            "Biography",
            "Humanitarian assistance"
        ],
        "latest_revision": 12,
        "publish_places": [
            "New York, NY"
        ],
        "copyright_date": null
    },
    {
        "title": "The burning room",
        "description": "In the LAPD's Open-Unsolved Unit, not many murder victims die almost a decade after the crime. So when a man succumbs to complications from being shot by a stray bullet nine years earlier, Bosch catches a case in which the body is still fresh, but all other evidence is virtually nonexistent. Now Bosch and his new partner, rookie Detective Lucia Soto, are tasked with solving what turns out to be a highly charged, politically sensitive case. Starting with the bullet that's been lodged for years in the victim's spine, they must pull new leads from years-old information, which soon reveals that this shooting may have been anything but random.",
        "authors": [
            {
                "key": "/authors/OL18979A",
                "name": "Michael Connelly"
            }
        ],
        "isbn": "9781409145660",
        "image-url": "https://www.harryhartog.com.au/cdn/shop/files/9781409145660_8623fdbc-36cf-49fe-a213-356f050fde7d.jpg",
        "price": "600",
        "publisher": [
            "Orion (an Imprint of The Orion Publishing Group Ltd )"
        ],
        "edition": "Paperback edition.",
        "num_pages": "438",
        "publish_date": "2015",
        "subjects": [
            "Fiction"
        ],
        "latest_revision": 25,
        "publish_places": [],
        "copyright_date": null
    }
]