[
    {
        "title": "My sister's keeper",
        "description": "Conceived to provide a bone marrow match for her leukemia-stricken sister, teenage Kate begins to question her moral obligations in light of countless medical procedures and decides to fight for the right to make decisions about her own body. New York Times bestselling author Jodi Picoult is widely acclaimed for her keen insights into the hearts and minds of real people. Now she tells the emotionally riveting story of a family torn apart by conflicting needs and a passionate love that triumphs over human weakness. Anna is not sick, but she might as well be. By age thirteen, she has undergone countless surgeries, transfusions, and shots so that her older sister, Kate, can somehow fight the leukemia that has plagued her since childhood. The product of preimplantation genetic diagnosis, Anna was conceived as a bone marrow match for Kate -- a life and a role that she has never challenged ... until now. Like most teenagers, Anna is beginning to question who she truly is. But unlike most teenagers, she has always been defined in terms of her sister -- and so Anna makes a decision that for most would be unthinkable, a decision that will tear her family apart and have perhaps fatal consequences for the sister she loves. My Sister's Keeper examines what it means to be a good parent, a good sister, a good person. Is it morally correct to do whatever it takes to save a child's life, even if that means infringing upon the rights of another? Is it worth trying to discover who you really are, if that quest makes you like yourself less? Should you follow your own heart, or let others lead you? Once again, in My Sister's Keeper, Jodi Picoult tackles a controversial real-life subject with grace, wisdom, and sensitivity.",
        "authors": [
            {
                "key": "/authors/OL78925A",
                "name": "Jodi Picoult"
            }
        ],
        "isbn": "9781416549178",
        "image-url": "https://prestigebookshop.com/wp-content/uploads/2019/02/book-image-5309.jpg",
        "price": "750",
        "publisher": [
            "Atria Books"
        ],
        "edition": "Atria books export ed.",
        "num_pages": "500",
        "publish_date": "2006",
        "subjects": [
          
            "Fiction"
      
      
        ],
        "latest_revision": 5,
        "publish_places": [
            "New York"
        ],
        "copyright_date": null
    },
    {
        "title": "Kennedy and King",
        "description": "An account of the contentious relationship between the thirty-fifth president and Martin Luther King, Jr. throughout the tumultuous early years of the civil rights movement explores their influence on one another and the important decisions that were inspired by their rivalry.",
        "authors": [
            {
                "key": "/authors/OL7518510A",
                "name": "Steven Levingston"
            }
        ],
        "isbn": "9780316267397",
        "image-url": "https://prestigebookshop.com/wp-content/uploads/2019/02/book-image-17964.jpg",
        "price": "2890",
        "publisher": [
            "Hachette Books"
        ],
        "edition": "First edition.",
        "num_pages": "511",
        "publish_date": "2017",
        "subjects": [

            "Civil rights",
            "African Americans",
            "Biography",
            "History"
        ],
        "latest_revision": 5,
        "publish_places": [],
        "copyright_date": null
    },
    {
        "title": "Big miracles",
        "description": "\"Experience the power of actively transforming your life with intuitive life coach Joanna Garzilli's revolutionary 11 Spiritual Rules for creating a Big Miracle Breakthrough, a life-changing program to manifest everyday miracles, create radical prosperity, and live a life filled with purpose. Imagine creating miracles every day. The power is in your hands with Big Miracle Breakthrough. Intuitive life coach Joanna Garzilli has helped countless clients, from executives to celebrities, makeover their lives and find ultimate fulfillment. Now, she invites you to experience the power of her practical, prescriptive 11-step system to manifest miracles that lead to big breakthroughs in your life. The 11 Spiritual Rules of Big Miracle Breakthrough will teach you exactly how to make huge positive changes in your life and to replace anxiety with tranquility, self-doubt with self-acceptance, and insecurity with certainty about your life purpose--how to achieve your dreams and actively create miracles. Each chapter shows you, with encouragement and grace, both how to live its lessons and how doing so will create your miracle. Laying the foundation with the first rule, Align with Spirit, Garzilli illustrates how to build from there to: Be a Spiritual Vehicle Commit to Your Breakthrough Forgive Mistakes Live Without Ego Believe in Your Ability Accept Responsibility Take the Right Action Be of Service Aim High Get Outside Your Comfort Zone With Big Miracle Breakthrough, you will discover how to nurture your connection to Spirit to move forward with momentum and create the outcomes you desire. Filled with deep wisdom, empowering meditations and journaling exercises, and concrete strategies for achieving the life of your dreams, Big Miracles is your own personal guide to creating the miracles you never thought possible\"--",
        "authors": [
            {
                "key": "/authors/OL7600845A",
                "name": "Joanna Garzilli"
            }
        ],
        "isbn": "9780062456984",
        "image-url": "https://prestigebookshop.com/wp-content/uploads/2019/02/book-image-18284.jpg",
        "price": "2790",
        "publisher": [
            "HarperElixir"
        ],
        "edition": "First edition.",
        "num_pages": "281",
        "publish_date": "2017",
        "subjects": [
            "Psychology",
            "Spiritual life",
            "Success"
        ],
        "latest_revision": 9,
        "publish_places": [],
        "copyright_date": null
    },
    {
        "title": "So you want to talk about race",
        "description": "\"A current, constructive, and actionable exploration of today's racial  landscape, offering straightforward clarity that readers of all races  need to contribute to the dismantling of the racial divide.  In So You Want to Talk About Race, Editor at Large of The Establishment, Ijeoma Oluo offers a contemporary, accessible take on the racial landscape in America, addressing head-on such issues as privilege, police brutality, intersectionality, micro-aggressions, the Black Lives Matter movement, and the \"N\" word. Perfectly positioned to bridge the gap between people of color and white Americans struggling with race complexities, Oluo answers the questions readers don't dare ask, and explains the concepts that continue to elude everyday Americans.  Oluo is an exceptional writer with a rare ability to be straightforward, funny, and effective in her coverage of sensitive, hyper-charged issues in America. Her messages are passionate but finely tuned, and crystalize ideas that would otherwise be vague by empowering them with aha-moment clarity. Her writing brings to mind voices like Ta-Nehisi Coates and Roxane Gay, and Jessica Valenti in Full Frontal Feminism, and a young Gloria Naylor, particularly in Naylor's seminal essay \"The Meaning of a Word.\"\"--",
        "authors": [
            {
                "key": "/authors/OL7512498A",
                "name": "Ijeoma Oluo"
            }
        ],
        "isbn": "9781580056779",
        "image-url": "https://prestigebookshop.com/wp-content/uploads/2019/02/book-image-18280.jpg",
        "price": "2790",
        "publisher": [
            "Seal Press"
        ],
        "edition": "First edition.",
        "num_pages": "248",
        "publish_date": "2018",
        "subjects": [
            "POLITICAL SCIENCE"
        ],
        "latest_revision": 13,
        "publish_places": [],
        "copyright_date": null
    },
    {
        "title": "The Universe Versus Alex Woods",
        "description": "Alex Woods knows that he hasn't had the most conventional start in life.\r\n\r\nHe knows that growing up with a clairvoyant single mother won't endear him to the local bullies.\r\n\r\nHe also knows that even the most improbable events can happen - he's got the scars to prove it, along with the rare meteorite that struck him on the head when he was ten years old.\r\n\r\nWhat he doesn't know yet is that when he meets ill-tempered, reclusive widower Mr. Peterson, he'll make an unlikely friend. Someone who tells him that you only get one shot at life. That you have to make the best possible choices.\r\n\r\nSo when, aged seventeen, Alex is stopped at Dover customs with 113 grams of marijuana, an urn full of ashes on the passenger seat, and an entire nation in uproar, he's fairly sure he's done the right thing . . .\r\n--back cover",
        "authors": [
            {
                "key": "/authors/OL7315407A",
                "name": "Gavin Extence"
            }
        ],
        "isbn": "9781473622661",
        "image-url": "https://textbookcentre.com//media/cache/b8/44/b8443bc716b7532f5cf86d829e443c84.jpg",
        "price": "600",
        "publisher": [
            "Hodder"
        ],
        "edition": "printing (15)",
        "num_pages": "407",
        "publish_date": "2013",
        "subjects": [
            "English literature"
        ],
        "latest_revision": 6,
        "publish_places": [
            "London"
        ],
        "copyright_date": "2013"
    },
    {
        "title": "Bridget Jones's Diary",
        "description": "It struck me as pretty ridiculous to be ca//ed Mr Darcy and to stand on your own looking snooty ot a party. It's like being ca//ed Heathcliff and insisting on spending the entire evening in the garden, shouting 'Cathy' and banging your head against a tree.\r\n\r\nBridget Jones's Diary documents Bridget's struggles through the social minefield of her thirties — the merits of being a singleton versus a smug married, the advantages of wearing a see-through top to work, and how to handle her crazed match-making mother. Through it all she is supported by four indispensable friends: Shazzer, Jude, Tom and a bottle of chardonnay. Is this a dazzling urban satire of modern relationships? An ironic, tragic insight into the demise of the nuclear family? Or the confused ramblings of a pissed thirty-something?\r\n\r\nBridget Jones's Diary was first published in 1996 and.applauded by critics from Salman Rushdie to Jilly Cooper. A number-one bestseller, it has sold over fifteen million copies worldwide and has become an indisputable modern classic.\r\n--back cover",
        "authors": [
            {
                "key": "/authors/OL7983884A",
                "name": "Helen Fielding"
            }
        ],
        "isbn": "9781509813889",
        "image-url": "https://textbookcentre.com//media/cache/3b/4b/3b4b7f7b2cd270166648672d8703e8d9.jpg",
        "price": "800",
        "publisher": [
            "Picador Classic"
        ],
        "edition": "printing (5)",
        "num_pages": "310",
        "publish_date": "2016",
        "subjects": [
            "English literature"
        ],
        "latest_revision": 6,
        "publish_places": [
            "London"
        ],
        "copyright_date": "2016"
    },
    {
        "title": "First children's dictionary",
        "description": "With over 3,000 entries of updated, curriculum-linked content, First Children's Dictionary is an ideal starting place for young children wanting to describe the world around them. From using a dictionary to word histories that help develop an understanding of where words come from, this dictionary for kids is an essential first reference book.",
        "authors": [
            {
                "key": "/authors/OL33235A",
                "name": "Marie Greenwood"
            }
        ],
        "isbn": "9780241228272",
        "image-url": "https://textbookcentre.com//media/cache/96/3b/963ba6c89a5e32007304dff9fc0c57ff.jpg",
        "price": "1150",
        "publisher": [
            "Dorling Kindersley"
        ],
        "edition": "Revised edition.",
        "num_pages": "32",
        "publish_date": "2016",
        "subjects": [
            "English language",
            "Juvenile literature"
        ],
        "latest_revision": 3,
        "publish_places": [
            "London"
        ],
        "copyright_date": null
    },
    {
        "title": "Scorpia",
        "description": "Alex Rider, teen spy, has always been told he is the spitting image of the father he never knew. But when Alex learns that his father may have been an assassin for the most lethal and powerful terrorist organization in the world, Scorpia, his world shatters. Now Scorpia wants Alex on their side, and Alex no longer has the strength to fight them. That is, until he learns of Scorpia&#x2019;s latest plot: an operation known only as “Invisible Sword” that will result in the death of thousands of people. Can Alex prevent the slaughter, or will Scorpia prove once and for all that the terror will not be stopped?",
        "authors": [
            {
                "key": "/authors/OL29053A",
                "name": "Anthony Horowitz"
            }
        ],
        "isbn": "9781406360233",
        "image-url": "https://textbookcentre.com//media/cache/75/98/75986cd012ed653b274d6d95a7692a1c.jpg",
        "price": "890",
        "publisher": [
            "Candlewick"
        ],
        "edition": "Fifteenth anniversary edition.",
        "num_pages": "360",
        "publish_date": "2015",
        "subjects": [
            "Juvenile fiction"
        ],
        "latest_revision": 21,
        "publish_places": [],
        "copyright_date": null
    },
    {
        "title": "The Boy In The Striped Pyjamas",
        "description": "The story of The Boy in the Striped Pyjamas is very difficult to describe. Usually we give some clues about the book on the cover, but in this case we think that would spoil the reading of the book. We think it is important that you start to read without knowing what it is about.\r\n\r\nIf you do start to read this book, you will go on a journey with a nine-year-old boy called Bruno. And sooner or later you will arrive with Bruno at a fence. We hope you never have to cross such a fence.",
        "authors": [
            {
                "key": "/authors/OL1432532A",
                "name": "John Boyne"
            }
        ],
        "isbn": "9781909531192",
        "image-url": "https://textbookcentre.com//media/cache/a6/69/a669dff1ea23b41e226ee2277180c2d0.jpg",
        "price": "890",
        "publisher": [
            "Deinitions"
        ],
        "edition": "Definitions edition (2)",
        "num_pages": "256",
        "publish_date": "2014",
        "subjects": [
            "Juvenile fiction"
        ],
        "latest_revision": 11,
        "publish_places": [
            "London"
        ],
        "copyright_date": "2006"
    }
]